<div class="main_wrap _main">

  <div class="content">

    <div class="breadcrumbs">
      <span class="B_crumbBox"><span class="B_lastCrumb"><span class="B_firstCrumb"><a class="B_homeCrumb" href="/" title="Алюминиевая компания в <?= Yii::$app->params['subdomen_dec'] ?>">Главная</a></span></span></span>
    </div>

    <h1>Политика конфиденциальности</h1>

    <p>Настоящая Политика конфиденциальности персональных данных (далее&nbsp;&mdash; Политика конфиденциальности) разработана в&nbsp;соответствии с&nbsp;положениями Федерального закона от&nbsp;27.07.2006 №&nbsp;152-ФЗ &laquo;О&nbsp;персональных данных&raquo; (с&nbsp;изменениями и&nbsp;дополнениями) и&nbsp;действует в&nbsp;отношении всей информации, которую Общество с&nbsp;ограниченной ответственностью ООО &laquo;Самарская алюминиевая компания&raquo; (далее&nbsp;&mdash; СамАлКо) может получить о&nbsp;Пользователе во&nbsp;время использования сайта https://samalco.ru/ и&nbsp;всех его Поддоменов.</p>
    <h2>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h2>
    <p>1.1. В настоящей Политике конфиденциальности используются следующие термины:</p>
    <p>1.1.1. &laquo;Администрация сайта&raquo;&nbsp;&mdash; сотрудники уполномоченные на&nbsp;управления сайтом, действующие от&nbsp;имени СамАлКо, которые организуют&nbsp;и (или) осуществляет обработку персональных данных, а&nbsp;также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с&nbsp;персональными данными.</p>
    <p>1.1.2. &laquo;Персональные данные&raquo;&nbsp;&mdash; любая информация, относящаяся прямо или косвенно к&nbsp;определенному или определяемому физическому лицу (субъекту персональных данных).</p>
    <p>1.1.3. &laquo;Обработка персональных данных&raquo;&nbsp;&mdash; любое действие (операция) или совокупность действий (операций) с&nbsp;персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</p>
    <p>1.1.4. &laquo;Конфиденциальность персональных данных&raquo;&nbsp;&mdash; обязательное для соблюдения Оператором или иным получившим доступ к&nbsp;персональным данным лицом требование не&nbsp;допускать их&nbsp;распространения без согласия субъекта персональных данных или наличия иного законного основания.</p>
    <p>1.1.5. &laquo;Пользователь сайта <a href="/">https://samalco.ru/</a>&raquo; (&laquo;далее Пользователь&raquo;)&nbsp;&mdash; лицо, имеющее доступ к&nbsp;Сайту и&nbsp;его Поддоменам, посредством сети Интернет и&nbsp;использующее Сайт или его Поддомены.</p>
    <p>1.1.6. &laquo;Сайт&raquo;&nbsp;&mdash; <a href="/">https://samalco.ru/</a>.</p>
    <p>1.1.7. &laquo;Поддомены&raquo;&nbsp;&mdash; <a href="https://spb.samalco.ru/">spb.samalco.ru</a>, <a href="https://samara.samalco.ru/">samara.samalco.ru</a>, <a href="https://chelyabinsk.samalco.ru/">chelyabinsk.samalco.ru</a>, <a href="https://perm.samalco.ru/">perm.samalco.ru</a>, <a href="https://volgograd.samalco.ru/">volgograd.samalco.ru</a>, <a href="https://kazan.samalco.ru/">kazan.samalco.ru</a>, <a href="https://tula.samalco.ru/">tula.samalco.ru</a>, <a href="https://ufa.samalco.ru/">ufa.samalco.ru</a>, <a href="https://rostov.samalco.ru/">rostov.samalco.ru</a>, <a href="https://nn.samalco.ru/">nn.samalco.ru</a>, <a href="https://ekb.samalco.ru/">ekb.samalco.ru</a>, <a href="https://nsk.samalco.ru/">nsk.samalco.ru</a>, <a href="https://omsk.samalco.ru/">omsk.samalco.ru</a>, <a href="https://tambov.samalco.ru/">tambov.samalco.ru</a>, <a href="https://kirov.samalco.ru/">kirov.samalco.ru</a>, <a href="https://tver.samalco.ru/">tver.samalco.ru</a>. 
    </p>
    <h2>2. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
    <p>2.1. Использование Пользователем Сайта и&nbsp;его Поддоменов означает согласие с&nbsp;настоящей Политикой конфиденциальности и&nbsp;условиями обработки персональных данных Пользователя.</p>
    <p>2.2. В&nbsp;случае несогласия с&nbsp;условиями Политики конфиденциальности Пользователь должен прекратить использование Сайта и&nbsp;его Поддоменов.</p>
    <p>2.3. Настоящая Политика конфиденциальности применяется только к&nbsp;сайту Общества с&nbsp;ограниченной ответственностью ООО &laquo;Самарская алюминиевая компания&raquo; и&nbsp;его Поддоменам. СамАлКо не&nbsp;контролирует и&nbsp;не&nbsp;несет ответственность за&nbsp;сайты третьих лиц, на&nbsp;которые Пользователь может перейти по&nbsp;ссылкам, доступным на&nbsp;Сайте и&nbsp;Поддоменах.</p>
    <p>2.4. Администрация сайта не&nbsp;проверяет достоверность персональных данных, предоставляемых Пользователем Сайта или Поддоменов.</p>
    <h2>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</h2>
    <p>3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта по&nbsp;неразглашению и&nbsp;обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по&nbsp;запросу Администрации сайта при оформлении заявки на&nbsp;получение услуги или консультации.</p>
    <p>3.2 Персональные данные, разрешённые к&nbsp;обработке в&nbsp;рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения форм заявки и&nbsp;обратной связи на&nbsp;Сайте или Поддоменах и&nbsp;могут включать в&nbsp;себя следующую информацию:</p>
    <p>3.2.1. Имя Пользователя;</p>
    <p>3.2.2. Контактный телефон Пользователя;</p>
    <p>3.2.3. Адрес электронной почты (e-mail) Пользователя;</p>
    <p>3.2.4. Комментарии к&nbsp;заявке.</p>
    <p>3.3. СамАлКо вправе использовать технологию &laquo;cookies&raquo;. &laquo;Cookies&raquo; не&nbsp;содержат конфиденциальную информацию. Посетитель Сайта или Поддоменов настоящим дает согласие на&nbsp;сбор, анализ и&nbsp;использование cookies, в&nbsp;том числе третьими лицами для целей формирования статистики и&nbsp;оптимизации рекламных сообщений.</p>
    <p>3.4. СамАлКо получает информацию об&nbsp;ip-адресе Посетителя Сайта или Поддоменов. Данная информация не&nbsp;используется для установления личности посетителя.</p>
    <p>3.5. СамАлКо вправе осуществлять записи телефонных разговоров с&nbsp;Посетителем Сайта или Поддоменов. При этом СамАлКо обязуется: предотвращать попытки несанкционированного доступа к&nbsp;информации, полученной в&nbsp;ходе телефонных переговоров, и/или передачу ее&nbsp;третьим лицам, не&nbsp;имеющим непосредственного отношения к&nbsp;предоставлению Услуг, в&nbsp;соответствии с&nbsp;п.&nbsp;4&nbsp;ст.&nbsp;16&nbsp;Федерального закона &laquo;Об&nbsp;информации, информационных технологиях и&nbsp;о&nbsp;защите информации&raquo;.</p>
    <p>3.6. Любая иная персональная информация неоговоренная выше (история посещения страниц, используемые браузеры и&nbsp;операционные системы и&nbsp;т.д.) подлежит надежному хранению и&nbsp;нераспространению, за&nbsp;исключением случаев, предусмотренных в&nbsp;п.п.&nbsp;5.2. и&nbsp;5.3. настоящей Политики конфиденциальности.</p>
    <h2>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</h2>
    <p>4.1. Персональные данные Пользователя Администрация сайта может использовать в&nbsp;целях:</p>
    <p>4.1.1. Идентификации Пользователя, оставившего заявку на&nbsp;Сайте или Поддомене, для получения консультации, оформления заказа и&nbsp;доставки товара.</p>
    <p>4.1.2. Установления с&nbsp;Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта или Поддоменов, формирования заказа, обработки запросов и&nbsp;заявок от&nbsp;Пользователя.</p>
    <p>4.1.3. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</p>
    <p>4.1.4. Подтверждения достоверности и&nbsp;полноты персональных данных, предоставленных Пользователем.</p>
    <p>4.1.5. Уведомления Пользователя Сайта или Поддоменов об&nbsp;обработке его запроса.</p>
    <p>4.1.6. Предоставления Пользователю эффективной клиентской и&nbsp;технической поддержки при возникновении проблем связанных с&nbsp;использованием Сайта или Поддоменов.</p>
    <p>4.1.7. Предоставления Пользователю специальных предложений, информации о&nbsp;ценах, новостной рассылки и&nbsp;иных сведений от&nbsp;имени СамАлКо или от&nbsp;имени его партнеров.</p>
    <p>4.1.8. Осуществления рекламной деятельности с&nbsp;согласия Пользователя.</p>
    <h2>5. СПОСОБЫ И&nbsp;СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</h2>
    <p>5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в&nbsp;том числе в&nbsp;информационных системах персональных данных с&nbsp;использованием средств автоматизации или без использования таких средств.</p>
    <p>5.2. Пользователь соглашается с&nbsp;тем, что Администрация сайта вправе передавать персональные данные третьим лицам, в&nbsp;частности, организациями почтовой связи, операторам электросвязи, исключительно в&nbsp;целях выполнения заявки Пользователя, оставленной на&nbsp;Сайте или Поддомене.</p>
    <p>5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по&nbsp;основаниям и&nbsp;в&nbsp;порядке, установленным законодательством Российской Федерации.</p>
    <p>5.4. Администрация сайта принимает необходимые организационные и&nbsp;технические меры для защиты персональной информации Пользователя от&nbsp;неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а&nbsp;также от&nbsp;иных неправомерных действий третьих лиц.</p>
    <p>5.5. Администрация сайта совместно с&nbsp;Пользователем принимает все необходимые меры по&nbsp;предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</p>
    <h2>ОБЯЗАТЕЛЬСТВА СТОРОН</h2>
    <p>6.1. Пользователь обязан:</p>
    <p>6.1.1. Предоставить информацию о&nbsp;персональных данных, необходимую для пользования Сайтом и&nbsp;Поддоменами.</p>
    <p>6.1.2. Обновить, дополнить предоставленную информацию о&nbsp;персональных данных в&nbsp;случае изменения данной информации.</p>
    <p>6.2. Администрация сайта обязана:</p>
    <p>6.2.1. Использовать полученную информацию исключительно для целей, указанных в&nbsp;п.&nbsp;4&nbsp;настоящей Политики конфиденциальности.</p>
    <p>6.2.2. Обеспечить хранение конфиденциальной информации в&nbsp;тайне, не&nbsp;разглашать без предварительного письменного разрешения Пользователя, а&nbsp;также не&nbsp;осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за&nbsp;исключением п.п.&nbsp;5.2. и&nbsp;5.3. настоящей Политики Конфиденциальности.</p>
    <p>6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в&nbsp;существующем деловом обороте.</p>
    <p>6.2.4. Осуществить блокирование персональных данных, относящихся к&nbsp;соответствующему Пользователю, с&nbsp;момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по&nbsp;защите прав субъектов персональных данных на&nbsp;период проверки, в&nbsp;случае выявления недостоверных персональных данных или неправомерных действий. Для отзыва согласия на&nbsp;обработку персональных данных необходимо подать соответствующее заявление в&nbsp;письменной форме по&nbsp;месту нахождения СамАлКо не&nbsp;менее чем за&nbsp;30&nbsp;дней до&nbsp;момента отзыва соответствующего согласия. После отзыва согласия персональные данные используются только в&nbsp;целях, предусмотренных законодательством.</p>
    <h2>7. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
    <p>7.1. В&nbsp;случае утраты или разглашения Конфиденциальной информации Администрация сайта не&nbsp;несёт ответственность, если данная конфиденциальная информация:</p>
    <p>7.1.1. Стала публичным достоянием до&nbsp;её&nbsp;утраты или разглашения.</p>
    <p>7.1.2. Была получена от&nbsp;третьей стороны до&nbsp;момента её&nbsp;получения Администрацией сайта.</p>
    <p>7.1.3. Была разглашена с&nbsp;согласия Пользователя.</p>
    <h2>8. РАЗРЕШЕНИЕ СПОРОВ</h2>
    <p>8.1. До&nbsp;обращения в&nbsp;суд с&nbsp;иском по&nbsp;спорам, возникающим из&nbsp;отношений между Пользователем сайта и&nbsp;Администрацией сайта, обязательным является предъявление претензии (письменного предложения о&nbsp;добровольном урегулировании спора).</p>
    <p>8.2. Получатель претензии в&nbsp;течение 30&nbsp;календарных дней со&nbsp;дня получения претензии, письменно уведомляет заявителя претензии о&nbsp;результатах рассмотрения претензии.</p>
    <p>8.3. При не&nbsp;достижении соглашения спор будет передан на&nbsp;рассмотрение в&nbsp;судебный орган в&nbsp;соответствии с&nbsp;действующим законодательством Российской Федерации.</p>
    <p>8.4. К&nbsp;настоящей Политике конфиденциальности и&nbsp;отношениям между Пользователем и&nbsp;Администрацией сайта применяется действующее законодательство Российской Федерации.
    </p>
    <p>8.5. Признание судом недействительности какого-либо положения настоящего Соглашения не&nbsp;влечет за&nbsp;собой недействительность остальных положений.</p>
    <h2>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
    <p>9.1. Администрация сайта вправе вносить изменения в&nbsp;настоящую Политику конфиденциальности без согласия Пользователя.</p>
    <p>9.2. Новая Политика конфиденциальности вступает в&nbsp;силу с&nbsp;момента ее&nbsp;размещения на&nbsp;Сайте и&nbsp;Поддоменах, если иное не&nbsp;предусмотрено новой редакцией Политики конфиденциальности.</p>
    <p>9.3. Все вопросы по&nbsp;настоящей Политике конфиденциальности следует адресовать на&nbsp;<a href="mailto:market@samalco.ru"><span>market@samalco.ru</span></a>.</p>

  </div>

</div>