<?php
exit;
// 	Запуск скрипта в SSH следующей командой:
// 		/usr/bin/php -f /var/www/samalco.ru/assets/parser/tableGenerate_rods.php
$aluFormType = "rods";
	
$balanceMin = 1;	$balanceMax = 1000;	$balanceIncrement = 1;
$priceMin = 220;	$priceMax = 250;	$priceIncrement = 1;
//----------------------
$alloys = ["АМц", "АМцС", "АМг2", "АМг3", "АМг5", "АМг6", "1561", "АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД0", "АД00", "АД31Е", "1201", "1163", "АД1", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"];

$heatTreatements = [
	'без т/о'=> [
		"АМц", "АМцС", "АМг2", "АМг3", "АМг5", "АМг6", "1561", "АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД0", "АД00", "АД31Е", "1201", "1163", "АД1", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'М'=> [
		"АМц", "АМцС", "АМг2", "АМг3", "АМг5", "АМг6", "1561", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "1915", "1925", "1935", "АД0", "АД00", "1201", "1163", "АД1", "Д20"
	],
	'Т'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т1'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т4'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т5'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т6'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т64'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т66'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	]
];


$diameters = ["8", "10", "12", "15", "16", "18", "20", "22", "25", "28", "30", "35", "40", "45", "50", "60", "80", "100", "120", "150", "200", "250", "300", "350", "400", "450", "500", "550", "600"];
$sections = ["круглый (КР)", "квадратный (КВ)", "шестигранный (ШГ)"];
$lengths = ["1000", "1200", "1500", "1800", "2000", "2200", "2500", "2800", "3000", "3200", "3500", "3800", "4000", "4500", "5000", "5500", "6000", "6500", "7000", "7500", "8000", "8500", "9000", "9500", "10000", "10500", "11000", "11500", "12000"];



$depth = 0;
$width = 0;
$height = 0;
$gostTemp = '';

$file = "/var/www/samalco.yii.ru/backend/components/$aluFormType.csv";

//Запись в файл
file_put_contents($file, "", LOCK_EX);	//предварительно чистим


foreach($heatTreatements as $heatTreatement => $alloys){
	foreach($alloys as $alloy){
		foreach($diameters as $diameter){
			foreach($sections as $section){
				foreach($lengths as $length){
					if(
						($diameter <= 50 && $length < 12000) || 
						($diameter > 50 && $diameter <= 100 && $length < 9000) || 
						($diameter > 100 && $diameter <= 300 && $length < 6000) || 
						($diameter > 300 && $length < 5000)
					) {
						$price = rand($priceMin, $priceMax);
						$balance = rand($balanceMin, $balanceMax);
						$stringLine = "$alloy;$heatTreatement;$diameter;$section;$length\n";
						$stringLine = "$alloy;$heatTreatement;$depth;$width;$height;$length;$diameter;$section;$gostTemp\n";

						file_put_contents($file, $stringLine, FILE_APPEND | LOCK_EX);
					}
				}
			}
		}
	}
}
