<?php
exit;
// 	Запуск скрипта в SSH следующей командой:
// 		/usr/bin/php -f /var/www/samalco.ru/assets/parser/tableGenerate_profil_ugolki.php
$aluFormType = "profil_ugolok";
	
$balanceMin = 3;	$balanceMax = 100;	$balanceIncrement = 1;
$priceMin = 110;	$priceMax = 150;	$priceIncrement = 1;
//----------------------
$alloys = ["АМц", "АМцС", "АМг2", "АМг3", "АМг5", "АМг6", "1561", "АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД0", "АД00", "АД31Е", "1201", "1163", "АД1", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"];

$heatTreatements = [
	'без т/о'=> [
		"АМц", "АМцС", "АМг2", "АМг3", "АМг5", "АМг6", "1561", "АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД0", "АД00", "АД31Е", "1201", "1163", "АД1", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'М'=> [
		"АМц", "АМцС", "АМг2", "АМг3", "АМг5", "АМг6", "1561", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "1915", "1925", "1935", "АД0", "АД00", "1201", "1163", "АД1", "Д20"
	],
	'Т'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т1'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т4'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т5'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т6'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т64'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	],
	'Т66'=> [
		"АД31", "АД33", "АД35", "АВ", "Д1", "Д16", "Д16ч", "Д19", "Д19ч", "АК4", "АК4-1", "АК4-1ч", "АК6", "АК6ч", "В95", "В95ч", "1915", "1925", "1935", "АД31Е", "1201", "1163", "6061", "6063", "Д20", "В95пч", "В95оч", "В96", "1973"
	]
];

$depths = ["2", "5", "10", "20", "30", "40", "50", "60", "70", "80", "90", "100", "120"];
$heights = ["10", "15", "20", "50", "100", "150", "200", "250", "300"];
$widths = ["10", "15", "20", "50", "100", "150", "200", "250", "300"];
$lengths = ["1500", "2000", "3000", "4000", "5000", "6000", "7000", "8000", "9000", "10000", "11000", "12000"];

$diameter = 0;
$section = '';
$gostTemp = '';

$file = "/var/www/samalco.yii.ru/backend/components/$aluFormType.csv";

//Запись в файл
file_put_contents($file, "", LOCK_EX);	//предварительно чистим


foreach($heatTreatements as $heatTreatement => $alloys){
	foreach($alloys as $alloy){
		foreach($depths as $depth){
			foreach($heights as $height){
				foreach($widths as $width){
					foreach($lengths as $length){
						if($height>$width || $height/$depth<2 || $width/$depth<2) {continue;}
						$price = rand($priceMin, $priceMax);
						$balance = rand($balanceMin, $balanceMax);
						$stringLine = "$alloy;$heatTreatement;$depth;$width;$height;$length;$diameter;$section;$gostTemp\n";

						file_put_contents($file, $stringLine, FILE_APPEND | LOCK_EX);
					}
				}
			}
		}
	}
}
